# # Задача 1
# # Даны два неупорядоченных набора целых чисел (может быть, с повторениями).
#  Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# # Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества.
#  Затем пользователь вводит сами элементы множеств.
# # 11 6
# # 2 4 6 8 10 12 10 8 6 4 2
# # 3 6 9 12 15 18
# # 6 12

n=int(input('Введите количество элементов в массиве n:'))
while n<=0  :
    n=int(input('Введите число большее 0 :' ))
m=int(input('Введите количество элементов в массиве m:'))
while m<=0  :
    m=int(input('Введите число большее 0 :' ))
     
n_list=[]
for i in range(n):
    num=int(input(f'Введите {i+1} элемент массива n:'))
    n_list.append(num)

m_list=[]
for i in range(m):
    num=int(input(f'Введите {i+1} элемент массива m:'))
    m_list.append(num)
n1=set(n_list).intersection(set(m_list))

print(f'Числа без повторений в порядке возрастания , которые встречаются в обоих наборах, следующие:{sorted(n1)}') 
